/*
 Localizable.strings
 Owncloud iOs Client
 
 Created by Javier Gonzalez on 7/17/12.
 */

/*
 Copyright (C) 2016, ownCloud GmbH.
 This code is covered by the GNU Public License Version 3.
 For distribution utilizing Apple mechanisms please see https://owncloud.org/contribute/iOS-license-exception/
 You should have received a copy of this license
 along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.en.html>.
 */


//First Screen
"go_to_login" = "إعداد حساب";
"you_need_an_account" = "لا وجود لأي من حسابات $ appname على جهازك.\r\nمن أجل استخدام هذا التطبيق ، تحتاج إلى إنشاء واحد.";

//Login Screen
"testing_connection" = "جار فحص الاتصال";
"server_instance_not_found" = "لم يتم العثور على الخادم";
"secure_connection_established" = "اتصال آمن";
"https_non_secure_connection_established" = "تم التوجيه لمسار غير آمن";
"connection_established" = "اتصال غير آمن";
"login_details" = "تفاصيل الدخول";
"username" = "إسم المستخدم";
"password" = "كلمة السر";
"login" = "اتصال";
"cancel" = "إلغاء";
"error_login_message" = "اسم المستخدم أو كلمة المرور غير صحيحة";
"error_updating_predefined_url" = "انتقل الخادم إلى عنوان URL مختلف. من فضلك ، قم بالمصادقة مرة أخرى لتحديث حسابك.";
"ok" = "تم";
"url_sample" = "عنوان الخادم https://…";
"forbidden_characters_in_password" = "كلمة المرور تحتوي رموزاً ممنوعة";
"server" = "خادم";
"url" = "عنوان الموقع";
"session_expired" = "مدة الجلسة انتهت , يرجى اعادة الاتصال";
"credentials_different_user" = "المستخدم المدخل لا يتوافق مع المستخدم الموجود في الحساب ";
"auth_unsupported_auth_method" = "الخادم لا يدعم طريقة التحقق هذه";
"server_does_not_give_user_id" = "الخادم لم يعود برقم مستخدم صحيح. الرجاء التواصل مع مسؤولك.";
"authentification_not_valid" = "لا يمكن المصادقة على هذا الخادم";
"error_too_many_http_redirects" = "حدث خطأ أثناء إنشاء الاتصال. الرجاء المحاولة مرة أخرى.";
"retry" = "عاود المحاولة";
"help_link_login" = "جديد على $appname ؟";
"error_could_not_add_account" = " تعذر تخزين معلومات المستخدم. حاول مرة اخرى.";
"account_not_new" = "الحساب لنفس المستخدم والخادم موجود مسبقا على الجهاز ";
"oauth2_error_access_denied" = "تم رفض الوصول من قبل الخادم المرخص";
"oauth2_error" = "فشل في التحقق";

//TabBarItems
"settings"="إعدادات";
"files_tab"="الملفات";

//Uploading
"upload" = "رفع";
"account" = "حساب:";
"location" = "المكان :";
"photo_albums" = "ألبومات الصور";
"loading" = "جاري التحميل ...";
"no_access_to_gallery" = "فضلاً فعّل وصول $appname إلى الصور والفيديو.  هذا الخيار قد تجده في إعدادات > الخصوصية > الصور .";
"error" = "خطأ";
"upload_failed"="فشل الرفع";
"redirection_problem"="إجراء إعادة توجيه إلى عنوان URL آخر عملية غير ممكنة";
"all_photos" = "جميع الصور";

//First View
"menu_upload" = "رفع صورة/ فيديو";
"menu_folder" = "مجلد جديد";
"menu_text_file" = "ملف نصي جديد";
"sort_menu_title" = "ترتيب";
"sort_menu_by_name_option" = "أ-ي";
"sort_menu_by_modification_date_option" = "الأحدث-الأقدم";
"sort_menu_by_kind_option" = "نوع";

//Create/Edit File Text
"create_text_file" = "إنشاء ملف نصي جديد";
"title_view_new_text_file" = "ملف نصي جديد";
"title_view_edit_text_file" = "تحرير ملف نصي";
"default_text_file_title" = "ملف نصي جديد";
"title_text_file_placeholder" = "العنوان...";
"body_text_file_placeholder" = "...";
"error_text_file_exist" = "موجود مسبقاً";
"error_file_name_empty" = "اسم الملف لا يجوز أن يكون فارغا";
"no_changes_made" = "لم يتم إجراء أية تغييرات.";
"no_file_downloaded" = "لم يتم تنزيل الملف ، لا يمكنك تحريره.";


//Create Folder
"create_folder" = "إنشاء مجلد جديد";
"folder_name" = "أدخل اسم المجلد";
"save" = "حفظ";
"folder_exist" = "يوجد مجلد بنفس هذا الإسم.  فضلاً أدخل اسماً آخر.";
"folder_create_error"="لم ينجح إنشاء المجلد";
"not_show_potrait"="القائمة غير متوفرة في عرض المناظر الطبيعية. الرجاء التغيير إلى العرض الرأسي.";
"not_possible_create_folder" = "غير قادر على إنشاء المجلد.";

//FilesView
"confirm_to_delete_item" = "تأكيد حذف العنصر";
"yes" = "نعم";
"no" = "لا";
"delete_from_device" = "هل أنت متأكد من رغبتك بحذف هذا الملف من الجهاز؟";
"delete_from_server" = "هل أنت متأكد من رغبتك بحذف هذا الملف من الخادم؟";
"not_possible_connect_to_server" = "لا يمكنك الاتصال بالخادم في هذا الوقت.";
"delete_folder_from_server" = "هل أنت متأكد من رغبتك بحذف هذا المجلد من الخادم؟";
"delete_local_server" = "حذف من الجهاز والخادم";
"delete_local" = "حذف من الجهاز";
"delete_server" = "حذف من الخادم";
"error_path" = "غير موجود. من فضلك تأكد من وجوده.";
"error_not_permission" = "ليست لديك الصلاحية لإتمام هذه العملية";
"folders" = "مجلدات";
"files" = "ملفات";
"folder" = "مجلد";
"file" = "ملف";
"more_swipe" = "المزيد";
"message_not_files" = "لا يوجد شيء هنا. إرفع بعض الملفات!";
"maintenance_mode_on_server_message" = "لا يمكن الاتصال بالخادم في الوقت الحالي. الخادم في وضع الصيانةحاليًا.";

//Refresh file list
"release_refresh"="اطلق للتحديث";
"loading_refresh"="جاري التحميل ...";
"pull_down_refresh"="اسحب للأسفل للتحديث";

//Miscelanea
"back" = "رجوع";

//Preview
"open_with_label" = "فتح باستخدام";
"delete_label"= "حذف";

//Open with
"file_cannot_be_opened" = "غير قادر على فتح هذا الملف";
"no_app_instaled_to_open_it" = "لايوجد تطبيق مثبت لفتح هذا النوع من الملفات.";

//WTClient messages (Download/Upload)
"establishing_connection" = "جار إنشاء الاتصال";
"not_establishing_connection" = "غير قادر على إنشاء الاتصال";
"connection_closed" = "الاتصال مغلق";
"connection_lost" = "فُقد الاتصال";
"auth_failed" = "فشل في التحقق";
"auth_passed" = "تم التحقق";
"request_file_not_found" = "الملف المطلوب غير موجود على الخادم";
"request_file_not_accesed" = "لا يمكن الوصول للملف المطلوب";
"unknow_response_server" = "خطأ. استجابة غير متوقعة من الخادم.";
"uploading_data" = "جار رفع البيانات";
"downloading_data" = "جار تحميل البيانات";
"transfer_complete" = "تم النقل";
"transfer_failed" = "فشل النقل";
"download_file" = "تحميل الملف";

//Settings and PinCode
"title_app_pin" = "قفل رمز المرور";
"title_app_pin_and_touchID" = "قفل رمز المرور & معرف اللمس";
"title_app_pin_and_faceID" = "قفل رمز المرور &  معرف الوجه";
"title_app_pin_forced" = "تغيير قفل رمز المرور";
"enter_app_pin" = "أدخل رمز المرور";
"enter_app_pin_long_description_forced" = "رمز المرور مطلوب. تحتاج إلى تعيين رمز مرور لتسجيل الدخول.";
"enter_app_pin_long_description" = "أدخل رمز المرور";
"reenter_app_pin" = "أعد إدخال رمز المرور";
"remove_app_pin" = "أزل رمز المرور";
"both_pass_not_same" = "رموز المرور التي تم إدخالها غير متطابقة";
"app_pin_incorrect" = "رمز المرور خاطئ";
"passcode_not_enabled" = "قم بتمكين رمز المرور أولاً";
"title_app_touchID" = "معرّف اللمسة";
"title_app_faceID" = "معرّف الوجه";
"disconnect_button" = "انقطع الاتصال بالخادم";
"pin_removed" = "تم حذف رمز المرور";
"incorrect_pin" = "رمز مرور خاطئ";
"app_pin_stored" = "تم تخزين رمز المرور";
"help" = "المساعدة";
"recommend_to_friend" = "انصح به صديق";
"send_feedback" = "ارسل لنا انطباعك";
"manage_accounts" = "إدارة الحسابات";
"add_new_account" = "إضافة حساب جديد";
"save_changes" = "حفظ";
"add_account" = "اضف";
"user_exist" = "المستخدم المدخل موجود مسبقاً";
"imprint_button" = "الانطباع";
"title_instant_upload_photos"="تحميل الصور سريعا";
"title_instant_upload_videos"="تحميل مقاطع الفيديو سريعا";
"title_background_instant_upload" = "التحميل الفوري في الخلفية";
"accounts_section" = "حسابات";
"security_section" = "الأمان";
"instant_updloads_section" = "رفع فوري";
"more_section" = "المزيد";
"unlock_app" = "فك قفل $appname";
"passcode_forced_can_not_be_disabled" = "تم فرض رمز المرور. لا يمكن تعطيله.";
"pending_migration_to_new_url" = "أدخل للانتقال إلى عنوان URL جديد";

//Downloading
"can_no_copy_to_gallery" = "لا يمكن نسخ هذا الملف للمعرض لأن المعرض لايفتح هذا الملف";
"file_is_downloading" = "هذا الملف قيد التحميل بالفعل";
"download_file_exist" = "تعذر فتح هذا الملف. يرجى التأكد من وجوده";
"wait_to_download" = "التحضير للتحميل";
"updating" = "التحديث جارٍ";
"msg_while_downloads" = "لايمكن القيام بهذه العملية ، فضلاً انتظر حتى انتهاء التحميل الحالي.";
"streaming_no_possible_ssl_self_signed" = "تعذر بدء البث نظرًا أن شهادة خادمك غير موثوق بها. سيبدأ تنزيل الملف تلقائيًا";

//SSL
"invalid_ssl_cert" = "لا يمكن التحقق من هوية الموقع. هل تريد الوثوق بهذه الشهادة على أية حال؟";
"connection_declined" = "رَفَضَ المستخدم الاتصال";
"server_certificate_untrusted" = "شهادة الخادم غير موثوق بها";

//Recent view
"recent_now"="قبل ثوان";
"recent_minutes"="منذ $minutes دقائق";
"recent_minute"="منذ $minutes دقيقة";
"recent_hours"="منذ $hours ساعات";
"recent_hour"="منذ $hours ساعة";
"recent_days"="منذ $days يوماً";
"recent_day"="منذ $days أيام";
"recent_months"="منذ $months شهراً";
"recent_month"="منذ $months شهور";

"uploads_tab"="التحميلات";
"current_section"="الحالي";
"uploader_section"="تم رفعه";
"nothing_was_upload_recently"="لم يتم رفع بيانات حديثاً من هذا الجهاز";
"failed_uploader_section"="عمليات الرفع الفاشلة";
"clear_successful"="نجح المسح";
"error_credential"="خطأ في بيانات الاعتماد";
"error_destiny_does_not_exist"="خطأ في المجلّد";
"error_file_exists"="خطأ تعارُض";
"error_permission" = "خطأ في الإذن";
"error_not_allowed_by_firewall_rule" = "التحميل غير مسموح به";
"error_file_does_not_exist" = "غير متوفر على الجهاز";
"error_file_in_background" = "خطا في الخادم";
"error_insufficient_storage" = "لا توجد مساحة كافية في الحساب";
"error_file_invalid_characters" = "حروف غير صالحة";
"change_active_user"="غيّر المستخدم النشط ليصبح";
"waiting_for_server"="بانتظار اتصال الخادم";
"waiting_for_upload"="بانتظار الرفع";
"error_permission_alert_message" = "ليس لديك صلاحية للرفع لهذا المجلد";
"choose_folder" = "اختر مجلد";

//Select Folder View
"upload_label"="الرفع إلى";
"create_button"="انشئ";
"choose_button"="اختيار";

//Rename
"rename_long_press" = "إعادة التسمية";
"rename_file_title" = "إعادة التسمية";
"enter_new_name" = "أدخل اسماً جديداً";
"rename_file_exist" = "يوجد ملف بنفس هذا الإسم.  فضلاً أدخل اسماً آخر.";

//Move
"move_long_press" = "أنقل";
"move_to_label" = "أنقل إلى";
"file_exist" = "الملف موجود بالفعل في المجلد الوجهة";
"override_file" = "هل ترغب استبدال الملف الموجود بهذا الملف ؟";
"accept" = "قبول";
"error_folder_destiny_is_the_same" = "خطأ: لايمكن نقل المجلد إلى نفسه";
"original_file_exist" = "غير قادر على نقل الملف.  فضلاً تأكد من وجوده";
"original_folder_exist" = "غير قادر على نقل المجلّد.  فضلاً تأكد من وجوده";

//Download folfer
"download_folder" = "مجلد التحميل";
"cancel_download" = "إلغاء التحميل";

//Upload from other apps
"other_apps_title" = "الوجهة";
"other_apps_account" = "حساب";
"other_apps_folder" = "مجلد";
"other_apps_file_name" = "اسم الملف";
"other_apps_send_to" = "الرفع إلى";
"error_moving_file" = "غير قادر على نقل الملف.  تأكد من وجود المجلّد الوجهة";
"forbidden_characters_from_server" = "اسم الملف به ، على الأقل ، حرف غير صالح";
"overwritte_title" = "استبدال";

//Social
"twitter_message" = "جرّب $twitteruser على هاتفك الذكي!";
"facebook_message" = "جرّب $appname على هاتفك الذكي!↩\n";
"mail_recommendation_subject" = "جرّب $appname على هاتفك الذكي!";
"mail_recommendation_body" = "أرغب دعوتك لاستخدام $appname على هاتفك الذكي  ↩\nالتحميل هنا:";
"device_not_support_mail" = "من فضلك ، قم بتكوين حساب بريدك الإلكتروني";
"mail_feedback_subject" = "تعليقات $ appname";
"account_not_configure" = "لم يتم تكوين الحساب في جهازك. انتقل إلى الإعدادات لتكوينه.";

//Storage
"of_storage" = "من";
"occupied_storage" = "مشغول";
"storage" = "وحدة التخزين";
"storage_upgrade" = "تحديث التخزين";

//Jimmies
"this_file_is_older" = "أحدث إصدار متاح";
"msg_update_file_0_bytes" = "يحتوي الملف على الخادم على 0 بايت. هل تريد استبدال الملف الموجود على جهازك بهذا الملف الفارغ؟";

//Shared
"shared_tab" = "روابط عامة";
"message_not_shared_files" = "لا توجد ملفات / مجلدات مشتركة بواسطة الرابط حتى الآن.";
"message_not_shared_api_support" = "عذرا ، لم يتم تمكين المشاركة على خادمك. الرجاء الاتصال بالمسؤول";
"share_link_long_press" = "شارك";
"unshare_link" = "الغاء مشاركة الرابط";
"share_not_available_on_this_server" = "عذرا ، هذه الميزة غير ممكّنة على خادمك. الرجاء الاتصال بمديرك";
"copy_link" = "نسخ الرابط";
"file_to_share_not_exist" = "غير قادر على مشاركة هذا الملف أو المجلد. من فضلك تأكد من وجوده";
"file_to_unshare_not_exist" = "تعذر إلغاء مشاركة هذا الملف أو المجلد. يرجى التأكد من وجوده";
"shared_link_protected_title" = "أدخل كلمة مرور";
"shared_link_protected_message" = "لمشاركة الرابط ، يجب إدخال كلمة مرور لحمايته.";
"pasword_empty" = "لا يمكن أن تكون كلمة المرور فارغة";
"no_pasword" = "يجب عليك إدخال كلمة مرور";
"get_share_link" = "احصل على الرابط العام";
"title_share_link_option_name" = "اسم الرابط";
"title_share_link_option_password" = "كلمة السر";
"title_share_link_option_expiration" = "إنتهاء";
"title_share_link_option_allow_dowload_view" = "تنزيل / عرض";
"title_share_link_option_allow_dowload_view_upload" = "تنزيل / عرض / تحميل";
"title_share_link_option_allow_upload_only" = "تحميل الملف فقط (إفلات الملف)";
"placeholder_share_link_option_name" = "الاسم";
"placeholder_share_link_option_password" = "اختيار كلمة مرور";
"placeholder_share_link_option_expiration" = "تاريخ إنتهاء الصلاحية";
"title_view_create_link" = "إنشاء مشاركة رابط";
"title_view_edit_link" = "تعديل مشاركة رابط";
"title_confirm_delete_link" = "إزالة الرابط";
"message_confirm_delete_link" = "! حذف $sharedLink";
"default_link_name" = "رابط $fileName";
"allow_editing" = "السماح بالتعديلات";
"show_error_password_enforced" = "كلمة المرور مطلوبة";
"show_error_expiration_enforced" = "ستنتهي صلاحية الرابط العام بعد إنشائه بمدة لا تتجاوز $nDays أيام ";
"default_not_possible_msg" = "لا يمكن القيام بهذه العملية ، يرجى المحاولة لاحقًا";
"share_user_group_indicator" = "مجموعة";
"share_user_federated_indicator" = "عن بعد";
"add_user_or_group_title" = "إضافة مستخدم أو مجموعة";
"share_with_users_or_groups" = "المستخدمون والمجموعات";
"not_share_with_users_yet"= " غير مشاركة مع أي مستخدم حتى الآن";
"not_share_by_link_yet"= " غير مشاركة بواسطة الرابط العام حتى الآن";
"not_sharee_api_supported" = "عذرًا ، إصدار خادمك لا يسمح بالمشاركة مع المستخدمين. الرجاء الاتصال بمديرك";
"share_link_title" = "ارتباطات عامة";
"warning_sharing_public_link" = "يمكن لأي شخص لديه الرابط الوصول إلى الملف/المجلد";
"not_share_link_enabled_capabilities" = "رابط المشاركة غير ممكّن في هذا الخادم. الرجاء الاتصال بمديرك";
"shared_link_cannot_remove_password" = "لا يمكن إزالة كلمة المرور";
"shared_link_cannot_remove_expiration_date" = "لا يمكن مسح تاريخ انتهاء الصلاحية. يجب أن يكون للمشاركات تاريخ انتهاء صلاحية";
"shared_link_mail_subject" = "$userName قام بمشاركة »$fileOrFolderName« معك";
"secured_link" = "مؤمن";
"message_private_link" = "رابط خاص: فقط الأشخاص الذين لديهم حق الوصول إلى الملف / المجلد يمكنهم استخدامه. استخدمه كرابط دائم لنفسك أو لتوجيه الآخرين إلى الملفات داخل المشاركات";

//Shared privileges
"title_user_can_edit" = " يستطيع التحرير";
"title_user_can_share" = "يستطيع المشاركة";
"user_can_create" = "إنشاء";
"user_can_change" = "تغيير";
"user_can_delete" = "حذف";
"title_view_edit_user_privileges" = "امتيازات";

//Shared Link Options
"title_view_share_link_options" = "خيارات الروابط";

//Favorites
"favorite" = "المفضلة";
"unfavorite" = "غير مفضل";
"parent_folder_is_favorite" = "مجلد يحتوي على هذا الملف هو مفضل بالفعل";

//Available offline
"available_offline" = "متوفر دون اتصال بالإنترنت";
"not_available_offline" = "غير متاح دون اتصال";
"parent_folder_is_available_offline_file_child" = "مجلد يحتوي على هذا الملف متاح بالفعل دون اتصال";
"parent_folder_is_available_offline_folder_child" = "مجلد يحتوي على هذا المجلد متاح بالفعل دون اتصال";

//Document provider
"error_login_doc_provider" = "غير قادر على الوصول إلى حسابك. الرجاء استخدام تطبيق $appname لتسجيل الدخول أولاً.";
"error_sending_file_to_document_picker" = "خطأ في إرسال الملف إلى منتقي المستندات";
"error_user_change_in_core_app" = "تم تغيير المستخدم في تطبيق $appname";
"error_connecting_with_server" = "لا يمكن الاتصال بالخادم ، يرجى المحاولة لاحقًا";
"move_doc_provider_button" = "انتقل إلى هذا الموقع";
"export_doc_provider_button" = "قم بالتصدير إلى هذا الموقع";

//Instant uploads
"location_not_enabled"="خدمات الموقع غير ممكّنة";
"message_location_not_enabled"="يرجى الانتقال إلى الإعدادات وتشغيل خدمات الموقع لتمكين عمليات التحميل السريع للصور في الخلفية.";

"access_photos_library_not_enabled" = "لم يتم تمكين الوصول إلى الصور";
"message_access_photos_not_enabled" = "الرجاء الانتقال إلى \"الإعداد\" وتشغيل \"الوصول إلى الصور\" للسماح بالتحميل السريع للصور.";

//PDF reader
"page_of_pages" = "من"; //Example: 5 of 10

//Share in
"files_added" = "تمت إضافة الملفات";
"files_will_be_upload_next_time" = "ستبدأ الملفات في التحميل في المرة المقبلة التي تفتح فيها $appname";

//Help Guide main app
"title_help_slide_0" = "مرحبًا بك في $appname!";
"message_help_slide_0" = "مرر لمعرفة المزيد";
"title_help_slide_1" = "رفع فوري";
"message_help_slide_1" = "حافظ على صورك آمنة";
"title_help_slide_2" = "قم بإدارة جميع ملفاتك";
"message_help_slide_2" = "يمكنك حذف أو نقل";
"title_help_slide_3" = "شارك";
"message_help_slide_3" = "يمكنك مشاركة الملفات والمجلدات";
"title_help_slide_4" = "متعدد الحسابات";
"message_help_slide_4" = "الاتصال بجميع السحب الخاصة بك";
"title_help_slide_5" = "تمت مزامنة ملفاتك الخاصة في أي مكان";
"message_help_slide_5" = "5";
"sign_in_button_help_guide" = "أدخل";
"skip_button_help_guide" = "تجاوُز";

//Update Guide main app
"title_update_slide_0" = "اكتشف تطبيق ownCloud الجديد";
"message_update_slide_0" = "تمت إعادة البناء من البداية لنظام iOS 11+";
"title_update_slide_1" = "عارض PDF";
"message_update_slide_1" = "سهولة البحث والتنقل";
"title_update_slide_2" = "إدارة الملفات";
"message_update_slide_2" = " \nمشاركة الملفات والمجلدات";
"title_update_slide_3" = "وصول سريع";
"message_update_slide_3" = "نظرة عامة على البيانات الكاملة";
"title_update_slide_4" = "حسابات متعددة";
"message_update_slide_4" = "الوصول إلى كل السحب الخاصة بك";
"title_update_slide_5" = "احصل عليه مجانًا من AppStore";
"message_update_slide_5" = "إدارة بيانات الأمان";
"sign_in_button_update_guide" = "تحميل";
"skip_button_update_guide" = "تحميل";

//Account menu
"menu_account_edit" = "تحرير كلمة المرور";
"menu_account_clear_cache" = "مسح ذاكرة التخزين المؤقتة";
"menu_account_log_out" = "حذف الحساب";

//Common
"not_connected_to_internet" = "الجهاز غير متصل بأي شبكة";
"bad_request" = "طلب غير صالح";
"method_not_allowed" = "طريقة غير مسموحة";
"proxy_auth_required" = "تفويض الوكيل مطلوب";
"conflict" = "تعارُض";
"internal_error" = "خطأ داخلي في الخادم";
"not_implemented" = "لم ينفذ";
"bad_gateway" = "مدخل سيء";

//Private links
"private_link_redirection_failed" = "العنصر غير موجود";
"error_connecting_with_server" = "لا يمكن الاتصال بالخادم ، يرجى المحاولة لاحقًا";
"private_link_not_reachable" = "لا يمكن فتح الرابط الخاص";
